In [1]:
import pandas as pd

In [2]:
import numpy as np

conos = pd.DataFrame({
    'Sabor': np.array(['mora', 'vainilla','chocolate', 'mora', 'chocolate']),
    'Precio': np.array([3500, 4700, 6500, 5200, 5700 ])
})

In [9]:
conos['Precio']

0    3500
1    4700
2    6500
3    5200
4    5700
Name: Precio, dtype: int64

In [10]:
conos[['Sabor', 'Precio']]

       Sabor  Precio
0       mora    3500
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [15]:
conos[: :-1]

       Sabor  Precio
4  chocolate    5700
3       mora    5200
2  chocolate    6500
1   vainilla    4700
0       mora    3500

In [18]:
conos[1:3]

       Sabor  Precio
1   vainilla    4700
2  chocolate    6500

In [20]:
conos.sort_values(by='Sabor', ascending=False)

       Sabor  Precio
1   vainilla    4700
0       mora    3500
3       mora    5200
2  chocolate    6500
4  chocolate    5700

In [21]:
conos.head(2)

      Sabor  Precio
0      mora    3500
1  vainilla    4700

In [22]:
conos.tail(1)

       Sabor  Precio
4  chocolate    5700

In [26]:
conos.sample(1)

  Sabor  Precio
3  mora    5200

In [27]:
conos.describe()

            Precio
count     5.000000
mean   5120.000000
std    1123.387734
min    3500.000000
25%    4700.000000
50%    5200.000000
75%    5700.000000
max    6500.000000

In [28]:
conos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sabor   5 non-null      object
 1   Precio  5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [30]:
conos.index

RangeIndex(start=0, stop=5, step=1)

In [31]:
conos.iloc[2]

Sabor     chocolate
Precio         6500
Name: 2, dtype: object

In [32]:
conos[1:]

       Sabor  Precio
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [33]:
conos.iloc[1:]

       Sabor  Precio
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [35]:
conos[2:5]

       Sabor  Precio
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [45]:
conos.iloc[[1,4]]

       Sabor  Precio
1   vainilla    4700
4  chocolate    5700

In [44]:
conos.iloc[2,1]

np.int64(6500)

In [48]:
conos['Precio'][2]

np.int64(6500)

In [49]:
conos_i = conos.set_index('Sabor', inplace=False)
conos_i

           Precio
Sabor
mora         3500
vainilla     4700
chocolate    6500
mora         5200
chocolate    5700

In [51]:
conos_i['Precio']

Sabor
mora         3500
vainilla     4700
chocolate    6500
mora         5200
chocolate    5700
Name: Precio, dtype: int64

In [53]:
conos_i.index

Index(['mora', 'vainilla', 'chocolate', 'mora', 'chocolate'], dtype='object', name='Sabor')

In [62]:
conos_i['Precio']['chocolate']

Sabor
chocolate    6500
chocolate    5700
Name: Precio, dtype: int64

In [64]:
conos_i.loc['vainilla', 'Precio']

np.int64(4700)

## Seleccion por condicion logica

In [69]:
#Mascara
conos['Precio']> 5000

0    False
1    False
2     True
3     True
4     True
Name: Precio, dtype: bool

In [70]:
conos[conos['Precio']> 5000]

       Sabor  Precio
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [75]:
conos[conos['Precio']<5000 ]

      Sabor  Precio
0      mora    3500
1  vainilla    4700

In [80]:
conos_i.loc['chocolate']

           Precio
Sabor
chocolate    6500
chocolate    5700

## Merge

In [6]:
conos = pd.DataFrame({
    'Sabor': np.array(['mora', 'vainilla','chocolate', 'mora', 'chocolate']),
    'Precio': np.array([3500, 4700, 6500, 5200, 5700 ])
})
conos

       Sabor  Precio
0       mora    3500
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [4]:
valoracion = pd.DataFrame({
    'Tipo' : np.array(['mora','chocolate', 'vainilla']),
    'Calificacion' : np.array([2.5, 3.5, 4])
})
valoracion

        Tipo  Calificacion
0       mora           2.5
1  chocolate           3.5
2   vainilla           4.0

In [22]:
clasificado = pd.merge(conos, valoracion, left_on='Sabor', right_on='Tipo')
clasificado

       Sabor  Precio       Tipo  Calificacion
0       mora    3500       mora           2.5
1   vainilla    4700   vainilla           4.0
2  chocolate    6500  chocolate           3.5
3       mora    5200       mora           2.5
4  chocolate    5700  chocolate           3.5

In [23]:
clasificado = pd.merge(conos, valoracion, left_on='Sabor', right_on='Tipo').drop('Tipo', axis=1)
clasificado

       Sabor  Precio  Calificacion
0       mora    3500           2.5
1   vainilla    4700           4.0
2  chocolate    6500           3.5
3       mora    5200           2.5
4  chocolate    5700           3.5

In [26]:
Precio = clasificado['Precio']
Puntuacion = clasificado['Calificacion']

clasificado['Precio/Puntuacion'] = Precio/Puntuacion
clasificado

       Sabor  Precio  Calificacion  Precio/Puntuacion
0       mora    3500           2.5        1400.000000
1   vainilla    4700           4.0        1175.000000
2  chocolate    6500           3.5        1857.142857
3       mora    5200           2.5        2080.000000
4  chocolate    5700           3.5        1628.571429

## Metodo Join

In [36]:
clasificado_N = conos.join(valoracion)
clasificado_N

       Sabor  Precio       Tipo  Calificacion
0       mora    3500       mora           2.5
1   vainilla    4700  chocolate           3.5
2  chocolate    6500   vainilla           4.0
3       mora    5200        NaN           NaN
4  chocolate    5700        NaN           NaN

In [40]:
clasificado.where(clasificado['Sabor'] == 'mora')

  Sabor  Precio  Calificacion  Precio/Puntuacion
0  mora  3500.0           2.5             1400.0
1   NaN     NaN           NaN                NaN
2   NaN     NaN           NaN                NaN
3  mora  5200.0           2.5             2080.0
4   NaN     NaN           NaN                NaN

In [44]:
clasificado[clasificado['Sabor'] == 'vainilla']

      Sabor  Precio  Calificacion  Precio/Puntuacion
1  vainilla    4700           4.0             1175.0

## GroupBy

In [46]:
import pandas as pd

helados = pd.DataFrame({
    'Sabor': ['mora', 'vainilla', 'chocolate', 'mora', 'chocolate', 'vainilla'],
    'Precio':[3500, 4700, 6500, 5200, 5700, 4800],
    'Ciudad':['Bogota', 'Bogota', 'Cali', 'Medellin', 'Bogota', 'Cali']
})

In [47]:
helados

       Sabor  Precio    Ciudad
0       mora    3500    Bogota
1   vainilla    4700    Bogota
2  chocolate    6500      Cali
3       mora    5200  Medellin
4  chocolate    5700    Bogota
5   vainilla    4800      Cali

In [48]:
helados.groupby('Sabor')['Precio'].mean()

Sabor
chocolate    6100.0
mora         4350.0
vainilla     4750.0
Name: Precio, dtype: float64

In [49]:
x = helados.groupby('Sabor')['Precio']
for i, j in x:
    print(i,j)

chocolate 2    6500
4    5700
Name: Precio, dtype: int64
mora 0    3500
3    5200
Name: Precio, dtype: int64
vainilla 1    4700
5    4800
Name: Precio, dtype: int64

In [52]:
helados.groupby('Ciudad')['Sabor'].count()

Ciudad
Bogota      3
Cali        2
Medellin    1
Name: Sabor, dtype: int64

In [53]:
helados.groupby('Ciudad').size()

Ciudad
Bogota      3
Cali        2
Medellin    1
dtype: int64

In [55]:
helados.groupby('Sabor')['Precio'].sum()

Sabor
chocolate    12200
mora          8700
vainilla      9500
Name: Precio, dtype: int64

# como obtener varias estadisticas

In [56]:
helados.groupby('Sabor')['Precio'].agg(['mean', 'max', 'min', 'count'])

             mean   max   min  count
Sabor
chocolate  6100.0  6500  5700      2
mora       4350.0  5200  3500      2
vainilla   4750.0  4800  4700      2

Agrupar por 2 columnas

In [60]:
helados.groupby(['Ciudad', 'Sabor'])['Precio'].max()

Ciudad    Sabor
Bogota    chocolate    5700
          mora         3500
          vainilla     4700
Cali      chocolate    6500
          vainilla     4800
Medellin  mora         5200
Name: Precio, dtype: int64

Dropna y Fillna

In [61]:
datos = pd.DataFrame({
    'Nombre':['Ana', 'Luis','Carlos', 'Marta', np.nan ],
    'Edad':[25, np.nan, 30, 22, 28],
    'Ciudad':['Bogota', 'Cali', np.nan, 'Medellin', 'Cali']
})

In [62]:
datos.dropna()

  Nombre  Edad    Ciudad
0    Ana  25.0    Bogota
3  Marta  22.0  Medellin

In [64]:
datos['Edad'].dropna()

0    25.0
2    30.0
3    22.0
4    28.0
Name: Edad, dtype: float64

In [65]:
datos.dropna(subset='Edad')

   Nombre  Edad    Ciudad
0     Ana  25.0    Bogota
2  Carlos  30.0       NaN
3   Marta  22.0  Medellin
4     NaN  28.0      Cali

thresh=n para las filas que tienen almenos n valores distintos de NaN

In [68]:
datos.dropna(thresh=2)

   Nombre  Edad    Ciudad
0     Ana  25.0    Bogota
1    Luis   NaN      Cali
2  Carlos  30.0       NaN
3   Marta  22.0  Medellin
4     NaN  28.0      Cali

Para rellenar datos faltantes usar fillna

In [69]:
datos.fillna('Desconocido')

        Nombre         Edad       Ciudad
0          Ana         25.0       Bogota
1         Luis  Desconocido         Cali
2       Carlos         30.0  Desconocido
3        Marta         22.0     Medellin
4  Desconocido         28.0         Cali

In [76]:
datos['Edad'].fillna(datos['Edad'].mean())

0    25.00
1    26.25
2    30.00
3    22.00
4    28.00
Name: Edad, dtype: float64

In [77]:
datos

   Nombre  Edad    Ciudad
0     Ana  25.0    Bogota
1    Luis   NaN      Cali
2  Carlos  30.0       NaN
3   Marta  22.0  Medellin
4     NaN  28.0      Cali